v1.1.1: Add badges, links and publishing guide
